const texts = {
    needSetUsername: 'Вам необходимо в настройках настроить Ваш username, чтобы Бот смог подобрать для Вас пару',
    start: 'Привет! Это бот для знакомств! Мы подберем тебе пару, исходя из твоих мемных предпочтений! Внимание! Используй бот, только если тебе больше 18-ти лет!',
    agreeFirst: 'Я подтверждаю, что мне большое 18-ти лет!',
    selectGender: 'Супер! Теперь укажи свой пол!',
    clickToButtons: 'Нужно нажать на кнопку ниже!',
    selectAge: 'Отлично! А теперь напиши свой возраст',
    maleButton: 'Мужской',
    femaleButton: 'Женский',
    incorrectAge: 'Введи корректный возраст',
    youngAge: 'Прости Наши знакомства только для тех, кому больше 18. Напиши ещё раз свой возраст',
    startRateMemes: 'Поехали! Оцени этот мем по шкале от 1 до 5',
    ratesMemes: {
        1: 'Понял! А по-моему смешной',
        2: 'А мне кажется смешно',
        3: 'Мне тоже нравится',
        4: 'Неплохо',
        5: 'Согласен!'
    },
    rateIncorrectValue: 'Что-то не понимаю тебя, отправь мне число от 1 до 5, где 1 - совсем не смешно, а 5 - "ахахахах" - в голос',
    willMatchPair: 'Сейчас я подбираю тебе пару. Пока я это делаю, подтверди что ты согласен на обработку персональных данных. Напиши «Согласен»',
    needWriteAgree: 'Нужно написать "Согласен"',
    matchingPair: 'Отлично, я уже подбираю пару',
    matchedPair: `
Я подобрал тебе идеальный мемный метч – такую пару сложно подобрать случайно, возможно, это судьба.

Вот она - %1

Только помни о правилах приличия ;)

И вдруг вы вместе захотите потом посмотреть сериал «Готовы на всё», который будет сегодня на СТС в 19:00`

}

module.exports = texts
